{"/blog/":{"data":{"":"\rRSS Feed "},"title":"Blog"},"/blog/bulb-app/":{"data":{"":"","command-to-start-the-server#Command to start the server":"","community-and-government-actions#\u003cstrong\u003eCommunity and Government Actions\u003c/strong\u003e":"","conclusion#Conclusion":"As the world grapples with the escalating challenges of climate change, understanding and monitoring environmental factors that directly impact human health has never been more crucial.\nOne such critical metric is the wet-bulb temperature (WBT), a combined measure of heat and humidity that provides a direct indicator of the body’s ability to cool itself through sweating. Ignoring this key metric can have serious health implications, particularly as climate change drives more frequent and severe heatwaves.\nWhat Is Wet-Bulb Temperature? Wet-bulb temperature represents the lowest temperature to which air can be cooled by the evaporation of water. Unlike regular air temperature, it accounts for both heat and humidity, making it a more accurate measure of heat stress on the human body.\nWhen humidity is high, sweat evaporates less efficiently, limiting the body’s natural cooling mechanism. A wet-bulb temperature of 35°C (95°F) is considered the upper physiological limit for human survival under prolonged exposure. Beyond this threshold, even healthy individuals resting in the shade can succumb to hyperthermia.\nGlobal warming has intensified heatwaves, which are now hotter, longer, and more widespread than ever before. According to recent climate models, wet-bulb temperatures that were once considered rare are becoming more frequent in tropical and subtropical regions.\n$$\r\\begin{aligned}\rT_{wb} \u0026= T \\cdot \\text{atan}(0.151977 \\cdot \\sqrt{RH + 8.313659}) \\\\\r\u0026\\quad + \\text{atan}(T + RH) \\\\\r\u0026\\quad - \\text{atan}(RH - 1.676331) \\\\\r\u0026\\quad + 0.00391838 \\cdot RH^{3/2} \\cdot \\text{atan}(0.023101 \\cdot RH) \\\\\r\u0026\\quad - 4.686035\r\\end{aligned}\r$$Why Is This Dangerous? Heat Stress and Health Risks: Prolonged exposure to high wet-bulb temperatures can lead to heat exhaustion, heatstroke, and even death. Vulnerable populations, such as the elderly, children, and individuals with pre-existing health conditions, are particularly at risk. Workplace Hazards: Outdoor laborers, especially in agriculture, construction, and other physically demanding industries, face increased risks of heat-related illnesses. Urban Heat Islands: Cities experience higher wet-bulb temperatures due to reduced vegetation, heat-absorbing surfaces like asphalt, and limited airflow, exacerbating health risks for urban populations. Why Monitoring Wet-Bulb Temperature Matters Given its direct correlation to human health, tracking wet-bulb temperature is vital for adapting to the challenges posed by climate change. Below are key reasons why monitoring WBT should be a priority:\nPreventing Heat-Related Illnesses Monitoring wet-bulb temperature enables early warnings for dangerous heat events. Governments and organizations can use this data to issue heat advisories, open cooling centers, and promote public awareness campaigns to protect vulnerable populations.\nImproving Workplace Safety For industries reliant on outdoor labor, WBT measurements can inform work-rest cycles and hydration protocols, reducing the risk of heatstroke and improving overall worker safety. Countries like Qatar have already implemented wet-bulb temperature thresholds to regulate outdoor work during extreme heat.\nUrban Planning and Resilience Cities can use wet-bulb temperature data to guide urban planning strategies, such as planting more trees, creating shaded areas, and designing buildings with better ventilation. These measures not only reduce heat stress but also improve overall urban livability.\nHealthcare Preparedness Healthcare systems can better allocate resources, such as emergency services and hospital capacities, by anticipating heatwave-related health impacts through wet-bulb temperature forecasts.\nOur Project - Wet Bulb Temperature CalculatorYou can acess our project in live.\nOverview This project is a Python-based application designed to calculate the wet-bulb temperature using temperature and relative humidity data obtained from the OpenWeather API. The app was developed with Flask to serve as an interactive web application and utilizes libraries such as requests for API access and math for calculations.\nProject Structure Directories and Files app.py: Main file containing Flask logic and API integration. templates/: Contains HTML files used in the interface. index.html: Home page of the application. static/: Contains static files like CSS and images (if needed). requirements.txt: List of Python dependencies for the project. README.md: Quick guide for installing and using the application. Technologies and Libraries Used Python 3.9 or later Flask: Web framework for creating the application. Requests: For making HTTP requests to the OpenWeather API. Gunicorn: For production deployment. Docker: For containerizing the application. Features Data Input: Users enter the name of a city. API Integration: The app makes a request to the OpenWeather API to obtain temperature and relative humidity data for the specified city. Wet-Bulb Temperature Calculation: Uses Stull’s formula to calculate the wet-bulb temperature. Web Interface: Displays the calculation result in a user-friendly interface. User Alerts: If the wet-bulb temperature exceeds 35°C, the app issues a warning indicating potentially hazardous health conditions. Installation and Setup Prerequisites Python 3.9 or later pip package manager OpenWeather API key (obtain at https://openweathermap.org/api) Installation Steps Clone the GitHub repository: bashgit clone https://github.com/jeronimo-molina/bulb-app.git cd bulb-app Create a virtual environment: bashpython3 -m venv venv source venv/bin/activate # On Windows, use `venv\\Scripts\\activate` Install dependencies: bashpip install -r requirements.txt Configure the API key: Create a .env file in the project root and add: OPENWEATHER_API_KEY=your_api_key_here\nStart the Flask server: bashflask run The app will be available at http://127.0.0.1:5000/.\nAlternative: Using Docker To simplify execution and distribution, the project supports Docker containerization.\nEnsure Docker is installed.\nBuild the Docker image: bashdocker build -t bulb-app . Run the container: bashdocker run -d -p 5000:5000 --env-file .env bulb-app The app will be available at http://127.0.0.1:5000/.\nProduction Deployment To run the application in production, use Gunicorn: bashpip install gunicorn Command to start the servergunicorn -w 4 app:app\nIt is recommended to configure a reverse proxy, such as Nginx, to manage HTTP connections.\nStrategies to Mitigate the Risks of High Wet-Bulb TemperaturesTo protect ourselves from the rising risks of extreme wet-bulb temperatures, we must adopt both individual and collective strategies:\nIndividual Actions Stay hydrated and avoid strenuous outdoor activities during peak heat hours. Wear loose, light-colored clothing to facilitate heat dissipation. Use fans or air conditioning to maintain cooler indoor environments. Monitor local weather reports for wet-bulb temperature readings and heed heat advisories. Community and Government Actions Invest in weather monitoring infrastructure to provide accurate, real-time wet-bulb temperature data. Develop public policies that regulate outdoor labor during extreme heat. Implement green infrastructure projects to reduce urban heat island effects. Foster international collaboration to address the broader implications of climate-induced heat stress. Wet-Bulb Temperature and the Future of Public Health As climate change accelerates, understanding the implications of wet-bulb temperature on human health is no longer optional—it is essential. Rising wet-bulb temperatures not only pose immediate threats to public health but also strain healthcare systems, disrupt economies, and exacerbate social inequalities.\nInvesting in technologies and policies to monitor and mitigate the impacts of wet-bulb temperatures is crucial for building resilience against the inevitable challenges posed by climate change. Awareness and proactive measures can save lives, improve public health outcomes, and ensure that communities remain safe in an increasingly warming world.\nConclusionThe wet-bulb temperature serves as a stark reminder of how closely our health is tied to the environment. As the planet warms, the importance of tracking this metric will only grow. By understanding and addressing the risks associated with high wet-bulb temperatures, we can adapt to the changing climate and safeguard our health and well-being.\nIn this era of unprecedented climate challenges, the ability to measure and respond to wet-bulb temperature extremes is not just a scientific necessity—it is a moral imperative.","features#Features":"","individual-actions#\u003cstrong\u003eIndividual Actions\u003c/strong\u003e":"","installation-and-setup#Installation and Setup":"","our-project---wet-bulb-temperature-calculator#Our Project - Wet Bulb Temperature Calculator":"","overview#Overview":"","project-structure#Project Structure":"","strategies-to-mitigate-the-risks-of-high-wet-bulb-temperatures#Strategies to Mitigate the Risks of High Wet-Bulb Temperatures":"","wet-bulb-temperature-and-the-future-of-public-health#Wet-Bulb Temperature and the Future of Public Health":"","what-is-wet-bulb-temperature#What Is Wet-Bulb Temperature?":"","why-monitoring-wet-bulb-temperature-matters#Why Monitoring Wet-Bulb Temperature Matters":""},"title":"Bulb Temperature Calculator"},"/docs/papers/":{"data":{"":"\rScientific texts published in journals\rManagerialist Discourse as a strategic practice in a municipal public administration Administration Radical and Plural Democracy as a method of Analysis in Critical Geopolitics International Politics Libertarianism in Power: an analysis of the possible impact of libertarian thought on public management in Caxias do Sul Administration Digital political marketing: how to engage voters in a candidate's ideas Political Science "},"title":"Papers"},"/docs/portfolio/":{"data":{"":"\rProjects made for me or someone that need it\rWet Bulb Temperature Calculator"},"title":"Portfolio"}}