{"/pt-br/about/":{"data":{"":"","abordagem-interdisciplinar-revisada#\u003cstrong\u003eAbordagem Interdisciplinar Revisada\u003c/strong\u003e":"","contato-e-colaborações#\u003cstrong\u003eContato e Colaborações\u003c/strong\u003e":"\rSou Jerônimo de Rossi Molina, doutorando em História pela Universidade de Passo Fundo (UPF), com foco em conflitos internacionais e dinâmicas políticas a partir de uma perspectiva interdisciplinar. Minha pesquisa integra ciência de dados, história conceitual e geopolítica para analisar padrões em disputas territoriais, crises diplomáticas e interações estratégicas entre Estados. Abaixo, compartilho minha trajetória, publicações em formato ABNT e objetivos revisados, alinhados a conflitos e política internacional.\rFormação e Objetivos de Pesquisa Minha jornada acadêmica começou nas humanidades, mas migrei para a ciência de dados buscando métodos mais robustos para analisar fenômenos políticos complexos. No mestrado — realizado em Administração — utilizei ferramentas estatísticas tradicionais, porém, com o tempo acabei migrand para Python e R, visando maior reprodutibilidade em estudos sobre conflitos históricos. No doutorado, concentro-me em conflitos internacionais e estratégias geopolíticas, utilizando modelos preditivos para entender como Estados e organizações respondem a crises — desde guerras por recursos até disputas de influência em cenários multipolares.\nComo cientista de dados, aplico técnicas de machine learning a bases históricas e contemporâneas, como registros diplomáticos e dados de organizações internacionais (ONU, OTAN, etc.). Meu GitHub reflete essa abordagem, com projetos que cruzam dados de fontes heterogêneas para mapear tensões geopolíticas.\nPublicações Minhas contribuições acadêmicas priorizam a interface entre dados, Adminsitração Pública e Política Internacional.\nde Rossi Molina, J. (2024). A DEMOCRACIA RADICAL E PLURAL COMO MÉTODO DE ANÁLISE EM GEOPOLÍTICA CRÍTICA. Hoplos - Revista De Estudos Estratégicos E Relações Internacionais, 8(15), 50-68. Recuperado de https://periodicos.uff.br/hoplos/article/view/63796\nMolina, J. (2019). Digital political marketing: how to engage voters in a candidate’s ideas. Interdisciplinary Journal of Applied Science, 4(7), 12–16. Retrieved from https://sou.ucs.br/revistas/index.php/ricaucs/article/view/75\nMolina, J. . (2019). Libertarianism in Power: an analysis of the possible impact of libertarian thought on public management in Caxias do Sul. Interdisciplinary Journal of Applied Science, 4(8), 8–16. Retrieved from https://sou.ucs.br/revistas/index.php/ricaucs/article/view/82\nMolina, J. D. R. (2024). O discurso gerencialista como prática es-tratégica em uma administração pública municipal. Gestão.org, 22(1). https://doi.org/10.51359/1679-1827.2024.261614\nPublicações em co-autoria Borsatto, C., Molina, J. D. R., Isoton, R., Bado, R., Giacomello, C. P., \u0026 Lazzari, F. (2022). EMPLOYMENT RELATIONSHIP BEFORE COVID-19 IN RS: AN ANALYSIS OF CAUSAL EFFECT AND REGRESSION. Brazilian Journal of Management and Innovation (Revista Brasileira De Gestão E Inovação), 9(3), 101–123. https://doi.org/10.18226/23190639.v9n3.05\nAbordagem Interdisciplinar Revisada Meu trabalho atual enfatiza conflitos internacionais e suas raízes históricas. Por exemplo, analiso disputas territoriais no século XX usando redes neurais para identificar padrões em discursos políticos e tratados. Outra frente é a modelagem de cenários de escalada de tensões, como a relação entre sanções econômicas e respostas estratégicas de Estados sob pressão. Esses modelos não apenas revisitam eventos históricos, mas também simulam possíveis desfechos para conflitos atuais. No Substack mantenho uma publicação, onde discuto temas como a ascensão de populismos e seu impacto na política externa, sempre vinculando teoria a dados empíricos.\nContato e Colaborações Convido pesquisadores e profissionais a explorarem meus códigos no GitHub e debaterem ideias no Medium. Para acesso a artigos completos, consultem:\nResearchGate GitHub E-mail ","formação-e-objetivos-de-pesquisa#\u003cstrong\u003eFormação e Objetivos de Pesquisa\u003c/strong\u003e":"","publicações#\u003cstrong\u003ePublicações\u003c/strong\u003e":"","publicações-em-co-autoria#\u003cstrong\u003ePublicações em co-autoria\u003c/strong\u003e":""},"title":"Sobre Mim"},"/pt-br/blog/":{"data":{"":"\rRSS Feed "},"title":"Blog"},"/pt-br/blog/bulb-app/":{"data":{"":"","ações-comunitárias-e-governamentais#\u003cstrong\u003eAções Comunitárias e Governamentais\u003c/strong\u003e":"","ações-individuais#\u003cstrong\u003eAções Individuais\u003c/strong\u003e":"","comando-para-iniciar-o-servidor#Comando para iniciar o servidor":"","conclusão#Conclusão":"À medida que o mundo enfrenta os desafios crescentes das mudanças climáticas, entender e monitorar os fatores ambientais que impactam diretamente a saúde humana nunca foi tão crucial.\nUm desses métricos críticos é a temperatura de bulbo úmido (TBU), uma medida combinada de calor e umidade que fornece um indicador direto da capacidade do corpo de se resfriar através da transpiração. Ignorar essa métrica chave pode ter sérias implicações para a saúde, especialmente à medida que as mudanças climáticas provocam ondas de calor mais frequentes e severas.\nO Que é a Temperatura de Bulbo Úmido? A temperatura de bulbo úmido representa a temperatura mais baixa à qual o ar pode ser resfriado pela evaporação da água. Ao contrário da temperatura do ar regular, ela leva em conta tanto o calor quanto a umidade, tornando-se uma medida mais precisa do estresse térmico no corpo humano.\nQuando a umidade é alta, o suor evapora menos eficientemente, limitando o mecanismo natural de resfriamento do corpo. Uma temperatura de bulbo úmido de 35°C (95°F) é considerada o limite fisiológico superior para a sobrevivência humana sob exposição prolongada. Além desse limite, mesmo indivíduos saudáveis descansando na sombra podem sucumbir à hipertermia.\nO aquecimento global intensificou as ondas de calor, que agora são mais quentes, longas e mais disseminadas do que nunca. De acordo com modelos climáticos recentes, temperaturas de bulbo úmido que antes eram consideradas raras estão se tornando mais frequentes em regiões tropicais e subtropicais.\n$$\r\\[ T_{wb} = T \\cdot \\text{atan}(0.151977 \\cdot \\sqrt{RH + 8.313659}) + \\text{atan}(T + RH) - \\text{atan}(RH - 1.676331) + 0.00391838 \\cdot RH^{3/2} \\cdot \\text{atan}(0.023101 \\cdot RH) - 4.686035 \\]\r$$Por Que Isso é Perigoso? Estresse Térmico e Riscos à Saúde: A exposição prolongada a altas temperaturas de bulbo úmido pode levar à exaustão por calor, insolação e até à morte. Populações vulneráveis, como idosos, crianças e indivíduos com condições de saúde preexistentes, estão particularmente em risco. Perigos no Local de Trabalho: Trabalhadores ao ar livre, especialmente na agricultura, construção e outras indústrias fisicamente exigentes, enfrentam riscos aumentados de doenças relacionadas ao calor. Ilhas de Calor Urbanas: As cidades experimentam temperaturas de bulbo úmido mais altas devido à vegetação reduzida, superfícies que absorvem calor como asfalto e fluxo de ar limitado, exacerbando os riscos à saúde para as populações urbanas. Por Que Monitorar a Temperatura de Bulbo Úmido é Importante Dada sua correlação direta com a saúde humana, acompanhar a temperatura de bulbo úmido é vital para se adaptar aos desafios impostos pelas mudanças climáticas. Abaixo estão as principais razões pelas quais monitorar a TBU deve ser uma prioridade:\nPrevenção de Doenças Relacionadas ao Calor Monitorar a temperatura de bulbo úmido permite alertas precoces para eventos de calor perigosos. Governos e organizações podem usar esses dados para emitir avisos de calor, abrir centros de resfriamento e promover campanhas de conscientização pública para proteger populações vulneráveis.\nMelhoria da Segurança no Trabalho Para indústrias que dependem de trabalho ao ar livre, as medições de TBU podem informar ciclos de trabalho-descanso e protocolos de hidratação, reduzindo o risco de insolação e melhorando a segurança geral dos trabalhadores. Países como o Catar já implementaram limites de temperatura de bulbo úmido para regular o trabalho ao ar livre durante o calor extremo.\nPlanejamento Urbano e Resiliência As cidades podem usar dados de temperatura de bulbo úmido para orientar estratégias de planejamento urbano, como plantar mais árvores, criar áreas sombreadas e projetar edifícios com melhor ventilação. Essas medidas não apenas reduzem o estresse térmico, mas também melhoram a habitabilidade urbana geral.\nPreparação na Saúde Os sistemas de saúde podem alocar melhor os recursos, como serviços de emergência e capacidades hospitalares, antecipando os impactos na saúde relacionados às ondas de calor através de previsões de temperatura de bulbo úmido.\nNosso Projeto - Calculadora de Temperatura de Bulbo ÚmidoVocê pode acessar nosso projeto ao vivo.\nVisão Geral Este projeto é um aplicativo baseado em Python projetado para calcular a temperatura de bulbo úmido usando dados de temperatura e umidade relativa obtidos da API OpenWeather. O aplicativo foi desenvolvido com Flask para servir como uma aplicação web interativa e utiliza bibliotecas como requests para acesso à API e math para cálculos.\nEstrutura do Projeto Diretórios e Arquivos app.py: Arquivo principal contendo a lógica do Flask e integração com a API. templates/: Contém arquivos HTML usados na interface. index.html: Página inicial da aplicação. static/: Contém arquivos estáticos como CSS e imagens (se necessário). requirements.txt: Lista de dependências Python para o projeto. README.md: Guia rápido para instalação e uso da aplicação. Tecnologias e Bibliotecas Utilizadas Python 3.9 ou posterior Flask: Framework web para criar a aplicação. Requests: Para fazer requisições HTTP à API OpenWeather. Gunicorn: Para implantação em produção. Docker: Para containerização da aplicação. Funcionalidades Entrada de Dados: Usuários inserem o nome de uma cidade. Integração com API: O aplicativo faz uma requisição à API OpenWeather para obter dados de temperatura e umidade relativa para a cidade especificada. Cálculo da Temperatura de Bulbo Úmido: Usa a fórmula de Stull para calcular a temperatura de bulbo úmido. Interface Web: Exibe o resultado do cálculo em uma interface amigável. Alertas ao Usuário: Se a temperatura de bulbo úmido exceder 35°C, o aplicativo emite um aviso indicando condições de saúde potencialmente perigosas. Instalação e Configuração Pré-requisitos Python 3.9 ou posterior Gerenciador de pacotes pip Chave da API OpenWeather (obtenha em https://openweathermap.org/api) Passos de Instalação Clone o repositório GitHub: git clone https://github.com/jeronimo-molina/bulb-app.git cd bulb-app Crie um ambiente virtual: bashpython3 -m venv venv source venv/bin/activate # No Windows, use `venv\\Scripts\\activate` Instale as dependências: bashpip install -r requirements.txt Configure a chave da API: Crie um arquivo .env na raiz do projeto e adicione: OPENWEATHER_API_KEY=sua_chave_api_aqui\nInicie o servidor Flask: bashflask run O aplicativo estará disponível em http://127.0.0.1:5000/.\nAlternativa: Usando Docker Para simplificar a execução e distribuição, o projeto suporta containerização com Docker.\nCertifique-se de que o Docker está instalado.\nConstrua a imagem Docker: bashdocker build -t bulb-app . Execute o container: bashdocker run -d -p 5000:5000 --env-file .env bulb-app O aplicativo estará disponível em http://127.0.0.1:5000/.\nImplantação em Produção Para executar a aplicação em produção, use Gunicorn: bashpip install gunicorn Comando para iniciar o servidorgunicorn -w 4 app:app\nRecomenda-se configurar um proxy reverso, como Nginx, para gerenciar conexões HTTP.\nEstratégias para Mitigar os Riscos de Altas Temperaturas de Bulbo ÚmidoPara nos proteger dos riscos crescentes de temperaturas extremas de bulbo úmido, devemos adotar estratégias tanto individuais quanto coletivas:\nAções Individuais Mantenha-se hidratado e evite atividades ao ar livre durante as horas de pico de calor. Use roupas soltas e de cores claras para facilitar a dissipação de calor. Use ventiladores ou ar condicionado para manter ambientes internos mais frescos. Monitore os relatórios meteorológicos locais para leituras de temperatura de bulbo úmido e siga os avisos de calor. Ações Comunitárias e Governamentais Investir em infraestrutura de monitoramento meteorológico para fornecer dados precisos e em tempo real de temperatura de bulbo úmido. Desenvolver políticas públicas que regulamentem o trabalho ao ar livre durante o calor extremo. Implementar projetos de infraestrutura verde para reduzir os efeitos das ilhas de calor urbanas. Fomentar a colaboração internacional para abordar as implicações mais amplas do estresse térmico induzido pelo clima. Temperatura de Bulbo Úmido e o Futuro da Saúde Pública À medida que as mudanças climáticas aceleram, entender as implicações da temperatura de bulbo úmido na saúde humana não é mais opcional—é essencial. As temperaturas crescentes de bulbo úmido não apenas representam ameaças imediatas à saúde pública, mas também sobrecarregam os sistemas de saúde, interrompem economias e exacerbam desigualdades sociais.\nInvestir em tecnologias e políticas para monitorar e mitigar os impactos das temperaturas de bulbo úmido é crucial para construir resiliência contra os desafios inevitáveis impostos pelas mudanças climáticas. A conscientização e as medidas proativas podem salvar vidas, melhorar os resultados de saúde pública e garantir que as comunidades permaneçam seguras em um mundo cada vez mais quente.\nConclusãoA temperatura de bulbo úmido serve como um lembrete claro de como nossa saúde está intimamente ligada ao meio ambiente. À medida que o planeta aquece, a importância de acompanhar essa métrica só crescerá. Ao entender e abordar os riscos associados às altas temperaturas de bulbo úmido, podemos nos adaptar às mudanças climáticas e proteger nossa saúde e bem-estar.\nNesta era de desafios climáticos sem precedentes, a capacidade de medir e responder aos extremos de temperatura de bulbo úmido não é apenas uma necessidade científica—é um imperativo moral.","estratégias-para-mitigar-os-riscos-de-altas-temperaturas-de-bulbo-úmido#Estratégias para Mitigar os Riscos de Altas Temperaturas de Bulbo Úmido":"","estrutura-do-projeto#Estrutura do Projeto":"","funcionalidades#Funcionalidades":"","instalação-e-configuração#Instalação e Configuração":"","nosso-projeto---calculadora-de-temperatura-de-bulbo-úmido#Nosso Projeto - Calculadora de Temperatura de Bulbo Úmido":"","o-que-é-a-temperatura-de-bulbo-úmido#O Que é a Temperatura de Bulbo Úmido?":"","por-que-monitorar-a-temperatura-de-bulbo-úmido-é-importante#Por Que Monitorar a Temperatura de Bulbo Úmido é Importante":"","temperatura-de-bulbo-úmido-e-o-futuro-da-saúde-pública#Temperatura de Bulbo Úmido e o Futuro da Saúde Pública":"","visão-geral#Visão Geral":""},"title":"Calculadora de Temperatura de Bulbo Úmido"},"/pt-br/docs/papers/":{"data":{"":"\rTextos científicos publicados em periódicos\rManagerialist Discourse as a strategic practice in a municipal public administration Administração Radical and Plural Democracy as a method of Analysis in Critical Geopolitics Política Internacional Libertarianism in Power: an analysis of the possible impact of libertarian thought on public management in Caxias do Sul Administração Digital political marketing: how to engage voters in a candidate's ideas Ciência Política "},"title":"Artigos Científicos"}}